In [3]:
import sqlite3
import pandas as pd

In [7]:
con = sqlite3.connect('ilovecat.db')

In [10]:
cur = con.cursor()

In [18]:
cur.execute('SELECT DISTINCT Name FROM EmplScore').fetchall()

[('Маша',), ('Петя',), ('Вася',), ('Саша',), ('Максим',)]

In [41]:
cur.execute("""

    SELECT Name, COUNT (Score)
    FROM EmplScore
    WHERE Score = '5'
    GROUP BY Name
    ORDER BY Score

""").fetchall()

[('Маша', 3), ('Саша', 2)]

In [46]:
df = pd.read_sql('SELECT DISTINCT Name FROM EmplScore', con)

In [44]:
df

     Name
0    Маша
1    Петя
2    Вася
3    Саша
4  Максим

In [47]:
df = pd.read_sql("""

    SELECT Name, COUNT (Score)
    FROM EmplScore
    WHERE Score = '5'
    GROUP BY Name
    ORDER BY Score

""", con)

In [48]:
df

   Name  COUNT (Score)
0  Маша              3
1  Саша              2